{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "LocalizeTable",
			"Children": [
				{
					"Source":
					{
						"Text": "LOCALIZATION SAMPLE"
					},
					"Translation":
					{
						"Text": "EXAMPLE DE LOCALISATION"
					},
					"Key": "TitleLabel"
				},
				{
					"Source":
					{
						"Text": "Select language"
					},
					"Translation":
					{
						"Text": "Choisir la langue"
					},
					"Key": "SelectLabel"
				},
				{
					"Source":
					{
						"Text": "Sound"
					},
					"Translation":
					{
						"Text": "Son"
					},
					"Key": "SoundLabel"
				},
				{
					"Source":
					{
						"Text": "Music"
					},
					"Translation":
					{
						"Text": "Musique"
					},
					"Key": "MusicLabel"
				},
				{
					"Source":
					{
						"Text": "There are <ItalicText>many</> ways to implement localization in <ColoredText>NoesisGUI</>. In this example we are using our <ColoredItalicText>LocTable</> markup extension to integrate with Unreal localization system where we defined localized texts for each label. Each time the language is changed, the displayed text is updated accordingly. The <ColoredItalicText>RichText</> attached property for <ItalicText>TextBlocks</> allows you to use Unreal styles and images in your text."
					},
					"Translation":
					{
						"Text": "Il y a <ItalicText>plusieurs</> façons d'implémenter la localisation dans <ColoredText>NoesisGUI</>. Dans cet exemple, nous utilisons notre <ColoredItalicText>LocTable</> markup extension pour intégrer le système de localisation Unreal où nous avons défini des textes localisés pour chaque étiquette. Chaque fois que la langue est modifiée, le texte affiché est mis à jour en conséquence. La propriété jointe <ColoredItalicText>RichText</> pour <ItalicText>TextBlocks</> vous permet d'utiliser des styles d'Unreal et images dans votre texte."
					},
					"Key": "DescLabel"
				}
			]
		}
	]
}